// Завдання No7. Який обробник запуститься?

// У змінній button знаходиться кнопка. Спочатку на ній немає обробників.
// Який із обробників запуститься? Що буде виведено під час кліку після виконання коду?
let button = document.querySelector('button');
button.addEventListener("click" , () => alert ( "1" ));
button.removeEventListener("click" , () => alert ( "1" )); // не буде виконано т.я. передана не таж функція, а інша з однаковім кодом
button.onclick = () => alert ( 2 );

//Спочатку запуститься button.addEventListener("click" , () => alert ( "1" )); , після віконання слідом button.onclick = () => alert ( 2 ); . Після віконня двох обробників подій при наступному нажатті на кнопку вони знову запустяться.