// Завдання No6. Розташуйте нотатку всередині елемента (абсолютне
//     позиціонування)
//     Удосконаліть рішення попереднього завдання : навчіть функцію positionAt(anchor ,
//     position , elem ) вставляти elem всередину anchor .
    
//     Нові значення для аргументу position :
//     • top-out , right-out , bottom-out – працюють так само, як раніше, вони вставляють
//     elem зверху/праворуч/знизу anchor .
//     • top-in , right-in , bottom-in – вставляють elem всередину anchor : приклеюють його
//     до верхнього/правого/нижнього краю.
//     Наприклад:
//     // показує замітку поверх цитати
//     positionAt(blockquote , " top - out " , note );
//     // показує нотатку всередині цитати поблизу верхнього краю елемента
//     positionAt(blockquote , "top-in" , note );