// Завдання No4. Покажіть нотатку поруч із елементом
// Створіть функцію positionAt(anchor, position, elem) , яка позиціонує елемент elem
// залежно від значення властивості position поряд з елементом anchor .
// Аргумент position – рядок з одним із 3 значень:
// • "top" - розмістити elem прямо над anchor
// • "right" - розмістити elem безпосередньо праворуч від anchor
// • "bottom" - розмістити elem прямо під anchor

// Вона використовується всередині функції showNote(anchor , position , html) , яка вже є у
// вихідному коді завдання. Вона створює і показує елемент-«примітку» з текстом html на
// заданій позиції position поряд з елементом anchor.